/**
 ****************************************************************************************************
 * @file        delay.h
 * @author      
 * @version     V1.0
 * @date        2026-02-06
 * @brief       使用SysTick的普通计数模式对延迟进行管理(支持ucosii)
 *              提供delay_init初始化函数， delay_us和delay_ms等延时函数
 * @license     Copyright (c) 20260206, 中南大学机电工程学院
 ****************************************************************************************************
 * @attention
 *
 * 实验平台:正点原子STM32F1精英版开发板和ATK-PD6010B电机驱动板
 * 
 * V1.0 20260206
 * 第一次发布
 *
 ****************************************************************************************************
 */
 
#ifndef __DELAY_H_
#define __DELAY_H_

#include "sys.h"

void delay_init(uint16_t sysclk);       /* 初始化延迟函数 */
void delay_ms(uint16_t nms);            /* 延时nms */
void delay_us(uint32_t nus);            /* 延时nus */

#endif





























